{
    "extractor": "ex1",
    "reference": {
        "ID": "R021",
        "Refstring": "Antinyan, V., & Staron, M. (2017). Rendex: A method for automated reviews of textual requirements. Journal of Systems and Software, 131, 63-77."
    },
    "timestamp": "2022-02-24 10:00:00",
    "factors": [
        {
            "id": "QF060",
            "name": "Vague",
            "linguistic complexity": "Lexical",
            "scope": "Word",
            "unambiguouseness": "-"
        },
        {
            "id": "QF091",
            "name": "Conjunctive Complexity",
            "linguistic complexity": "Lexical",
            "scope": "Sentence",
            "simplicity": "-",
            "understandability": "-"
        },
        {
            "id": "QF151",
            "name": "Referring to fixed terms",
            "linguistic complexity": "Lexical",
            "scope": "Word",
            "understandability": "+"
        },
        {
            "id": "QF152",
            "name": "Referring to other documents",
            "linguistic complexity": "Lexical",
            "scope": "Word",
            "reusability": "+",
            "understandability": "+"
        },
        {
            "id": "QF153",
            "name": "Number of words",
            "linguistic complexity": "Lexical",
            "scope": "Requirement",
            "maintainability": "-",
            "understandability": "-"
        }
    ],
    "descriptions": [
        {
            "id": "D160",
            "qf id": "QF091",
            "reference": "R021",
            "definition": "\"[L]inguistic conjunctions that indicate a relation of two related actions in a requirement\"",
            "impact": "\"When the number of conjunctions increases the number of relations between actions also increases. This leads to a complex description of many actions and relations, which creates difficult for understanding how to implement and test the given requirement. Particularly, it becomes hard to follow how the actions comply with or has mandate over each other, and what the sequences of actions are in relation to one another.\"",
            "empirical evidence": false,
            "practitioners involved": true
        },
        {
            "id": "D161",
            "qf id": "QF060",
            "reference": "R021",
            "definition": "\"[P]hrases that indicate either imprecise definition or multiple interpretations of a requirement\"",
            "impact": "\"[T]he vague phrases indicate the unclearness of the actions or actors, and their relations. In other words vague phrases introduce interpretative nature to the requirement description\"",
            "empirical evidence": false,
            "practitioners involved": true
        },
        {
            "id": "D162",
            "qf id": "QF151",
            "reference": "R021",
            "definition": "\"[V]ariables such as state, sensor data, and module names in a requirement\"",
            "impact": "\"Many such variable names in a requirement indicate that much knowledge is required to understand how all these variables can and will interact together. We observed that for requirements of component level these references are one of the main constituents of the requirements and by the perception of the software engineers a high number of NR can indicate problems\"",
            "empirical evidence": false,
            "practitioners involved": true
        },
        {
            "id": "D163",
            "qf id": "QF152",
            "reference": "R021",
            "definition": "\"[R]eferences to standards and other documents in a requirement\"",
            "impact": "\"[W]hen designers encounter reference documents in requirements, they have to look through them in order to understand how the implemented requirement should comply or be consistent with the documents. Often, there were no specifics on how exactly the requirement should comply with the referred document.\"",
            "empirical evidence": false,
            "practitioners involved": true
        },
        {
            "id": "D164",
            "qf id": "QF153",
            "reference": "R021",
            "definition": "\"The number of words of a requirement\"",
            "impact": "\"[I]f an artifact is too big then it is hard to understand and manage\"",
            "empirical evidence": false,
            "practitioners involved": true
        }
    ],
    "datasets": [],
    "approaches": []
}