{
    "extractor": "ex1",
    "reference": {
        "ID": "R035",
        "Refstring": "Din, C. Y., & Rine, D. C. (2008). Requirements content goodness and complexity measurement based on NP chunks. VDM Publishing."
    },
    "timestamp": "2022-02-24 10:00:00",
    "quality factors": [],
    "descriptions": [
        {
            "id": "D062",
            "qf id": "QF057",
            "reference": "R035",
            "definition": "\"The sentence level complexity metric, or NPC-Sentence, can be calculated as follows. For each NP chunk, the occurrence count in a sentence is divided by the total occurrence counts in all sentences. Then all the frequency distributions of the NP chunks in the sentence are added together to form the final complexity value. The requirements statement level complexity metric, or NPC Req, is the aggregation of NPC-Sentence of the component sentences.\"",
            "impact": "",
            "empirical evidence": false,
            "practitioners involved": false
        },
        {
            "id": "D063",
            "qf id": "QF058",
            "reference": "R035",
            "definition": "\"The proposed NPC-Cohesion metric is a normalized cluster size that can be calculated using the sum of all cluster sizes in a requirement section divided by the size of the requirements section. Here a cluster is defined as the collection of adjacent sentences in a requirements section that shares the same NP chunks.\"",
            "impact": "",
            "empirical evidence": false,
            "practitioners involved": false
        },
        {
            "id": "D064",
            "qf id": "QF059",
            "reference": "R035",
            "definition": "\"The proposed NPC-Coupling metric value is the sum of the spatial distances between its internal and external NP chunks. If an NP chunk belongs to a cluster, then the centroid of the cluster is used to calculate its distance to the external NP chunks.\"",
            "impact": "",
            "empirical evidence": false,
            "practitioners involved": false
        }
    ],
    "data sets": [],
    "approaches": []
}